### Pandas Exercise

<center>
    <img src = https://media2.giphy.com/media/qOPGFmMPDlsty/200w.webp?cid=ecf05e47hfi5q40ehdtxyp4t3qy2s9ppp9992hnmnekb2afx&rid=200w.webp/>
</center>

----

Below we have some basic problems using built in datasets from seaborn.  Be sure to watch the videos to review Pandas and keep your cheat sheet close.  Feel free to add any cells that you need to, and don't hesitate to explore the data more than these basic prompts!

-----

In [1]:
import seaborn as sns

In [2]:
car_crashes = sns.load_dataset('car_crashes')

In [3]:
car_crashes.head(2)

,total,speeding,alcohol,not_distracted,no_previous,ins_premium,ins_losses,abbrev
0,18.8,7.332,5.640,18.048,15.040,784.55,145.08,AL
1,18.1,7.421,4.525,16.290,17.014,1053.48,133.93,AK

In [5]:
car_crashes['new_cl'] = car_crashes['speeding'] * car_crashes['alcohol']

In [6]:
car_crashes.head(2)

,total,speeding,alcohol,not_distracted,no_previous,ins_premium,ins_losses,abbrev,new_cl
0,18.8,7.332,5.640,18.048,15.040,784.55,145.08,AL,41.352480
1,18.1,7.421,4.525,16.290,17.014,1053.48,133.93,AK,33.580025

In [7]:
titanic = sns.load_dataset('titanic')

In [19]:
penguins = sns.load_dataset('penguins')

### Titanic

![](https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/RMS_Titanic_3.jpg/600px-RMS_Titanic_3.jpg)

In [9]:
###Examine the first five rows of the data

In [10]:
###Print out the information about the dataset

In [16]:
###How many female passengers were in first class?
titanic.loc[(titanic['sex'] == 'female')&(titanic['pclass'] == 1)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
52,1,1,female,49.0,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
856,1,1,female,45.0,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True

In [15]:
#there are 94 passengers who were female and pclass 1

(94, 15)

In [18]:
### How many children under the age of twelve perished?
titanic.loc[(titanic['age']<12) & (titanic['alive'] == 'no')].shape

(29, 15)

### Car Crashes

![](https://fivethirtyeight.com/wp-content/uploads/2014/10/469364835crop.jpg?w=1150)


Please see [kaggle](https://www.kaggle.com/fivethirtyeight/fivethirtyeight-bad-drivers-dataset) for a description of the dataset.  Also, please skim the accompanying 538 article [here](https://fivethirtyeight.com/features/which-state-has-the-worst-drivers/).

In [17]:
#What are the 5 states with most fatal collisions
#involving drivers who were not distracted?

In [27]:
#Which states had the most alcohol related crashes?
car_crashes.head(1)

,total,speeding,alcohol,not_distracted,no_previous,ins_premium,ins_losses,abbrev,new_cl
0,18.8,7.332,5.64,18.048,15.04,784.55,145.08,AL,41.35248

In [29]:
car_crashes.nlargest(5, 'alcohol')

,total,speeding,alcohol,not_distracted,no_previous,ins_premium,ins_losses,abbrev,new_cl
34,23.9,5.497,10.038,23.661,20.554,688.75,109.72,ND,55.178886
40,23.9,9.082,9.799,22.944,19.359,858.97,116.29,SC,88.994518
26,21.4,8.346,9.416,17.976,18.190,816.21,85.15,MT,78.585936
43,19.4,7.760,7.372,17.654,16.878,1004.75,156.83,TX,57.206720
11,17.5,9.450,7.175,14.350,15.225,861.18,120.92,HI,67.803750

In [30]:
car_crashes['total_by_number_alchohol'] = car_crashes['alcohol']/100 * car_crashes['total']

In [31]:
car_crashes.nlargest(5, 'total_by_number_alchohol')

,total,speeding,alcohol,not_distracted,no_previous,ins_premium,ins_losses,abbrev,new_cl,total_by_number_alchohol
34,23.9,5.497,10.038,23.661,20.554,688.75,109.72,ND,55.178886,2.399082
40,23.9,9.082,9.799,22.944,19.359,858.97,116.29,SC,88.994518,2.341961
26,21.4,8.346,9.416,17.976,18.190,816.21,85.15,MT,78.585936,2.015024
48,23.8,8.092,6.664,23.086,20.706,992.61,152.56,WV,53.925088,1.586032
43,19.4,7.760,7.372,17.654,16.878,1004.75,156.83,TX,57.206720,1.430168

In [19]:
#What states had the highest insurance premiums?

In [20]:
#Lowest insurance premiums?

In [21]:
#Is there a relationship between speeding and alcohol?
#HINT: Try to make a scatter plot using the cheat sheet

### Penguins

<center>
    <img src = https://github.com/allisonhorst/palmerpenguins/raw/master/man/figures/logo.png width = 40% />
</center>


Please refer to the description on this [github repo](https://github.com/allisonhorst/palmerpenguins).

In [20]:
#What is the average bill length for female penguins?
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [23]:
penguins.loc[penguins['sex'] == 'FEMALE'].describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      165.000000     165.000000         165.000000   165.000000
mean        42.096970      16.425455         197.363636  3862.272727
std          4.903476       1.795681          12.500776   666.172050
min         32.100000      13.100000         172.000000  2700.000000
25%         37.600000      14.500000         187.000000  3350.000000
50%         42.800000      17.000000         193.000000  3650.000000
75%         46.200000      17.800000         210.000000  4550.000000
max         58.000000      20.700000         222.000000  5200.000000

In [22]:
penguins.loc[penguins['sex'] == 'FEMALE'].mean()

bill_length_mm         42.096970
bill_depth_mm          16.425455
flipper_length_mm     197.363636
body_mass_g          3862.272727
dtype: float64

In [26]:
penguins.loc[penguins['sex'] == 'FEMALE']['bill_length_mm'].mean()

42.096969696969694

In [23]:
#Draw a barplot of the counts of species

In [24]:
#What was the largest flipper in 2007?

In [25]:
#Draw a boxplot of the body mass column